
import { TranslationRecord } from "../types";

const languageFrameworksTranslations: TranslationRecord = {
  a1Level: "A1 - Начальный",
  a2Level: "A2 - Элементарный",
  b1Level: "B1 - Средний",
  b2Level: "B2 - Средний продвинутый",
  c1Level: "C1 - Продвинутый",
  c2Level: "C2 - Свободное владение",
  
  a1Descriptor: "Может понимать и использовать знакомые повседневные выражения и очень базовые фразы, направленные на удовлетворение конкретных потребностей.",
  a2Descriptor: "Может общаться по простым и обычным задачам, требующим простого и прямого обмена информацией по знакомым и обычным вопросам.",
  b1Descriptor: "Может справляться с большинством ситуаций, которые могут возникнуть во время путешествия по области, где говорят на целевом языке.",
  b2Descriptor: "Может взаимодействовать со степенью беглости и спонтанности, которая делает регулярное взаимодействие с носителями языка вполне возможным без напряжения для любой из сторон.",
  c1Descriptor: "Может выразить себя бегло и спонтанно без очевидного поиска выражений, эффективно используя язык для социальных и профессиональных целей.",
  c2Descriptor: "Может понимать практически все, что слышит или читает с легкостью, может выразить себя спонтанно, очень бегло и точно.",
};

export default languageFrameworksTranslations;
